In [1]:
import numpy as np
import pandas as pd

In [2]:
data_one = {'a': ['a0', 'a1', 'a2', 'a3'], 'b': ['b0', 'b1', 'b2', 'b3']}

In [3]:
data_two = {'c': ['c0', 'c1', 'c2', 'c3'], 'd': ['d0', 'd1', 'd2', 'd3']}

In [4]:
one = pd.DataFrame(data_one)

In [5]:
two = pd.DataFrame(data_two)

In [6]:
one

    a   b
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3

In [7]:
two

    c   d
0  c0  d0
1  c1  d1
2  c2  d2
3  c3  d3

## concat

In [8]:
pd.concat([one, two], axis=1)

    a   b   c   d
0  a0  b0  c0  d0
1  a1  b1  c1  d1
2  a2  b2  c2  d2
3  a3  b3  c3  d3

In [9]:
pd.concat([one, two], axis=0)

     a    b    c    d
0   a0   b0  NaN  NaN
1   a1   b1  NaN  NaN
2   a2   b2  NaN  NaN
3   a3   b3  NaN  NaN
0  NaN  NaN   c0   d0
1  NaN  NaN   c1   d1
2  NaN  NaN   c2   d2
3  NaN  NaN   c3   d3

In [10]:
two.columns = one.columns

In [11]:
two

    a   b
0  c0  d0
1  c1  d1
2  c2  d2
3  c3  d3

In [13]:
pd.concat([one, two], axis=0)

    a   b
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3
0  c0  d0
1  c1  d1
2  c2  d2
3  c3  d3

In [14]:
myds = pd.concat([one, two], axis=0, ignore_index=True)
myds.index = range(len(myds))
myds

    a   b
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3
4  c0  d0
5  c1  d1
6  c2  d2
7  c3  d3

## inner merge

In [15]:
registrations = pd.DataFrame({'reg_id':[1,2,3,4],'name':['Andrew','Bobo','Claire','David']})
logins = pd.DataFrame({'log_id':[1,2,3,4],'name':['Xavier','Andrew','Yolanda','Bobo']})

In [16]:
registrations

   reg_id    name
0       1  Andrew
1       2    Bobo
2       3  Claire
3       4   David

In [17]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     Bobo

In [19]:
#help(pd.merge)

In [20]:
pd.merge(registrations, logins, how='inner', on='name')

   reg_id    name  log_id
0       1  Andrew       2
1       2    Bobo       4

## left and right merge

In [21]:
pd.merge(registrations, logins, on='name', how='left')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    Bobo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [22]:
pd.merge(registrations, logins, on='name', how='right')

   reg_id     name  log_id
0     NaN   Xavier       1
1     1.0   Andrew       2
2     NaN  Yolanda       3
3     2.0     Bobo       4

## outer

In [23]:
pd.merge(registrations, logins, on='name', how='outer')

   reg_id     name  log_id
0     1.0   Andrew     2.0
1     2.0     Bobo     4.0
2     3.0   Claire     NaN
3     4.0    David     NaN
4     NaN   Xavier     1.0
5     NaN  Yolanda     3.0